Autodesk.Revit.DB.Structure.AnalyticalLine.GetTrf(System.Double)
The parameter value along a curve that should be in the range [0.0, 1.0], where 0.0 represents start and 1.0 represents end of the element.
Since:
2021

Autodesk.Revit.DB.Structure.AnalyticalLine.SetCurveEnd(Autodesk.Revit.DB.XYZ,System.Int32)
Sets curve end point.
point:
the new end for the curve.
end:
Specifies which end: 0 means start, 1 means end.
Throws Autodesk.Revit.Exceptions.ArgumentException:
end is not a valid value (must be 0 (start), 1 (end)).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2021

Autodesk.Revit.DB.Structure.AnalyticalLine.GetCurve
Remarks:
Returns curve of analytical line.
Since:
2021

Autodesk.Revit.DB.Structure.AnalyticalLine.SetCurve(Autodesk.Revit.DB.Curve)
Sets analytical curve.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2021

Autodesk.Revit.DB.Structure.AnalyticalLine.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Curve)
Creates a new instance of an analytical line within the project.
aDoc:
A Revit document.
curve:
Curve of the analytical line.
Returns:
The newly created AnalyticalLine instance.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2021

Autodesk.Revit.DB.Structure.AnalyticalLine
An element that represents a line in the structural analytical model.
Since:
2021